# DataFrame
## Create DataFrame

In [55]:
import numpy as np
import pandas as pd

In [56]:
#A DataFrame with onlt data.
df1 = pd.DataFrame(np.arange(1,13).reshape(3,4))

In [57]:
df1

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [58]:
df2 = pd.DataFrame(np.arange(1,13))
df2

     0
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9   10
10  11
11  12

In [59]:
type(df2)

pandas.core.frame.DataFrame

In [60]:
# Creating via a dictionary
df_dict = {
    'city':['北京', '上海', '广州', '深圳'],
    'price':(120000, 110000, 100000, 90000),
    'year':np.array([2018,2019,2020,2021])
}

In [61]:
df3 = pd.DataFrame(df_dict)

In [62]:
df3

  city   price  year
0   北京  120000  2018
1   上海  110000  2019
2   广州  100000  2020
3   深圳   90000  2021

In [63]:
df4 = pd.DataFrame(df_dict, index = list('abcd'))

In [64]:
df4

  city   price  year
a   北京  120000  2018
b   上海  110000  2019
c   广州  100000  2020
d   深圳   90000  2021

In [65]:
df4x = pd.DataFrame(df_dict,
                    index=list('abcd'),
                    columns=['year', 'city', 'price'])

In [66]:
df4x

   year city   price
a  2018   北京  120000
b  2019   上海  110000
c  2020   广州  100000
d  2021   深圳   90000

In [67]:
df5 = pd.DataFrame(df_dict,
                    index=list('abcd'),
                    columns=['year', 'city', 'prioce'])
df5

   year city prioce
a  2018   北京    NaN
b  2019   上海    NaN
c  2020   广州    NaN
d  2021   深圳    NaN

In [68]:
df5x = pd.DataFrame(df_dict,
                    index=list('abcd'),
                    columns=['year', 'city'])

In [69]:
df5x

   year city
a  2018   北京
b  2019   上海
c  2020   广州
d  2021   深圳

## Access

In [70]:
df5.head(2)

   year city prioce
a  2018   北京    NaN
b  2019   上海    NaN

In [71]:
df5x.tail(3)

   year city
b  2019   上海
c  2020   广州
d  2021   深圳

In [72]:
df4x.take([1])

   year city   price
b  2019   上海  110000

In [73]:
df4x.take([2,1,3])

   year city   price
c  2020   广州  100000
b  2019   上海  110000
d  2021   深圳   90000

In [74]:
df4x.take([2,1],axis=0)

   year city   price
c  2020   广州  100000
b  2019   上海  110000

In [75]:
df4x.take([2,1],axis=1)

    price city
a  120000   北京
b  110000   上海
c  100000   广州
d   90000   深圳

In [76]:
df4x.columns

Index(['year', 'city', 'price'], dtype='object')

In [77]:
type(df4x.columns)

pandas.core.indexes.base.Index

In [78]:
df4x.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [79]:
type(df4x.index)

pandas.core.indexes.base.Index

In [80]:
df4x.values

array([[2018, '北京', 120000],
       [2019, '上海', 110000],
       [2020, '广州', 100000],
       [2021, '深圳', 90000]], dtype=object)

In [81]:
type(df4x.values)

numpy.ndarray

In [82]:
df4x.values.shape
#Row, Column  values

(4, 3)

In [83]:
df4x.describe()
# Central tendency and dispersion of continuous variables.
# Central tendency : mean±std, Q2(Q1, Q3)midpoint
# dispersion : std, min, max, Q1, Q3, count

              year          price
count     4.000000       4.000000
mean   2019.500000  105000.000000
std       1.290994   12909.944487
min    2018.000000   90000.000000
25%    2018.750000   97500.000000
50%    2019.500000  105000.000000
75%    2020.250000  112500.000000
max    2021.000000  120000.000000

In [84]:
df4x.describe(include='all')

               year city          price
count      4.000000    4       4.000000
unique          NaN    4            NaN
top             NaN   北京            NaN
freq            NaN    1            NaN
mean    2019.500000  NaN  105000.000000
std        1.290994  NaN   12909.944487
min     2018.000000  NaN   90000.000000
25%     2018.750000  NaN   97500.000000
50%     2019.500000  NaN  105000.000000
75%     2020.250000  NaN  112500.000000
max     2021.000000  NaN  120000.000000

In [85]:
S2 = pd.Series(np.random.rand(10))

In [86]:
S2

0    0.483051
1    0.235610
2    0.658115
3    0.952394
4    0.212811
5    0.220649
6    0.138701
7    0.487546
8    0.479663
9    0.452154
dtype: float64

In [87]:
S2.describe()

count    10.000000
mean      0.432069
std       0.246670
min       0.138701
25%       0.224389
50%       0.465909
75%       0.486422
max       0.952394
dtype: float64

In [88]:
df4x.info()
#Series doesn't have info method

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    4 non-null      int32
 1   city    4 non-null      object
 2   price   4 non-null      int64
dtypes: int32(1), int64(1), object(1)
memory usage: 112.0+ bytes

## Slicing and index of DataFrame
### Access a column

In [89]:
df4x

   year city   price
a  2018   北京  120000
b  2019   上海  110000
c  2020   广州  100000
d  2021   深圳   90000

In [90]:
df4['city']

a    北京
b    上海
c    广州
d    深圳
Name: city, dtype: object

In [91]:
type(df4['city'])

pandas.core.series.Series

In [92]:
df4[['city']]

  city
a   北京
b   上海
c   广州
d   深圳

In [93]:
type(df4[['city']])

pandas.core.frame.DataFrame

In [94]:
df4[['city', 'year']]

  city  year
a   北京  2018
b   上海  2019
c   广州  2020
d   深圳  2021

In [95]:
df4x.year

a    2018
b    2019
c    2020
d    2021
Name: year, dtype: int32

In [96]:
df4x.city

a    北京
b    上海
c    广州
d    深圳
Name: city, dtype: object

In [97]:
type(df4x.city)

pandas.core.series.Series

In [98]:
df4x.city.a

'北京'

In [99]:
df4x.loc['a']

year       2018
city         北京
price    120000
Name: a, dtype: object

In [100]:
type(df4x.loc['a'])

pandas.core.series.Series

In [101]:
df4x.loc[['a']]

   year city   price
a  2018   北京  120000

In [102]:
df4x.iloc[[0]]

   year city   price
a  2018   北京  120000

In [103]:
df4x.iloc[[0,3,1]]

   year city   price
a  2018   北京  120000
d  2021   深圳   90000
b  2019   上海  110000

In [104]:
df4x.city.d
# column-major

'深圳'

In [105]:
df4x.loc['d', 'city']
# row-major

'深圳'

In [106]:
df4x.iloc[3,1]

'深圳'

In [107]:
df4x.loc['a', 'city']

'北京'

In [108]:
df4x.loc[['a', 'city']]

KeyError: "['city'] not in index"

In [109]:
df4x.loc['d'].city # ↓

'深圳'

In [110]:
df4x.loc['d'].loc['city'] # ↓

'深圳'

In [111]:
df4x.loc['d', 'city']

'深圳'

In [112]:
df4.loc['d', 'price']

90000

In [113]:
df4x

   year city   price
a  2018   北京  120000
b  2019   上海  110000
c  2020   广州  100000
d  2021   深圳   90000

In [114]:
df4x.loc['d', 'price'] = 150000

In [115]:
df4x

   year city   price
a  2018   北京  120000
b  2019   上海  110000
c  2020   广州  100000
d  2021   深圳  150000

In [116]:
df4x.price < 120000

a    False
b     True
c     True
d    False
Name: price, dtype: bool

In [117]:
df4x[df4x.price < 120000].city

b    上海
c    广州
Name: city, dtype: object

In [118]:
df4x['year' : 'city']

Empty DataFrame
Columns: [year, city, price]
Index: []

In [119]:
df4x.loc['a':'b', 'year':'city']

   year city
a  2018   北京
b  2019   上海

In [120]:
df4x.loc['a':'d']

   year city   price
a  2018   北京  120000
b  2019   上海  110000
c  2020   广州  100000
d  2021   深圳  150000

In [121]:
df4x.loc[:,'year':'city'] # [    ]

   year city
a  2018   北京
b  2019   上海
c  2020   广州
d  2021   深圳

In [122]:
df4x.iloc[:,0:2]   # [     )

   year city
a  2018   北京
b  2019   上海
c  2020   广州
d  2021   深圳

In [123]:
df4x.iloc[1:3, 0:2]

   year city
b  2019   上海
c  2020   广州

In [124]:
df4x

   year city   price
a  2018   北京  120000
b  2019   上海  110000
c  2020   广州  100000
d  2021   深圳  150000

In [125]:
df4x.iloc[1,2]

110000

## Modification and Addition of DataFrame

In [126]:
df4x['people'] = 3000

In [127]:
df4x

   year city   price  people
a  2018   北京  120000    3000
b  2019   上海  110000    3000
c  2020   广州  100000    3000
d  2021   深圳  150000    3000

In [128]:
df4x['people'] = 2000

In [129]:
df4x

   year city   price  people
a  2018   北京  120000    2000
b  2019   上海  110000    2000
c  2020   广州  100000    2000
d  2021   深圳  150000    2000

In [130]:
df4x.people

a    2000
b    2000
c    2000
d    2000
Name: people, dtype: int64

In [131]:
df4x.people = 1500

In [132]:
df4x

   year city   price  people
a  2018   北京  120000    1500
b  2019   上海  110000    1500
c  2020   广州  100000    1500
d  2021   深圳  150000    1500

In [133]:
df4x.people1 = 3000
# Added a new attribute to the DataFrame

In [134]:
df4x

   year city   price  people
a  2018   北京  120000    1500
b  2019   上海  110000    1500
c  2020   广州  100000    1500
d  2021   深圳  150000    1500

In [135]:
df4x.people1

3000

In [136]:
df4x.people

a    1500
b    1500
c    1500
d    1500
Name: people, dtype: int64

In [137]:
df4x['people1'] = np.arange(4)

In [138]:
df4x

   year city   price  people  people1
a  2018   北京  120000    1500        0
b  2019   上海  110000    1500        1
c  2020   广州  100000    1500        2
d  2021   深圳  150000    1500        3

In [139]:
sa1 = pd.Series(range(10,15), index=list('abefg'))

In [140]:
sa1

a    10
b    11
e    12
f    13
g    14
dtype: int64

In [141]:
df4x['p2'] = sa1

In [142]:
df4x

   year city   price  people  people1    p2
a  2018   北京  120000    1500        0  10.0
b  2019   上海  110000    1500        1  11.0
c  2020   广州  100000    1500        2   NaN
d  2021   深圳  150000    1500        3   NaN

In [143]:
df4x.loc['e'] = 'sss'

In [144]:
df4x

   year city   price people people1    p2
a  2018   北京  120000   1500       0  10.0
b  2019   上海  110000   1500       1  11.0
c  2020   广州  100000   1500       2   NaN
d  2021   深圳  150000   1500       3   NaN
e   sss  sss     sss    sss     sss   sss

In [145]:
sa2 = df4x.loc['d']

In [146]:
sa2

year         2021
city           深圳
price      150000
people       1500
people1         3
p2            NaN
Name: d, dtype: object

In [147]:
sa2.city = '南京'
#C:\Users\lenovo\AppData\Local\Temp\ipykernel_34532\3116153440.py:1: SettingWithCopyWarning: 
# A value is trying to be set on a copy of a slice from a DataFrame

# See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
#   sa2.city = '南京'

C:\Users\lenovo\AppData\Local\Temp\ipykernel_22280\1210282797.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sa2.city = '南京'

In [148]:
sa2

year         2021
city           南京
price      150000
people       1500
people1         3
p2            NaN
Name: d, dtype: object

In [149]:
df4x.loc['e'] = sa2

In [150]:
df4x

   year city   price people people1    p2
a  2018   北京  120000   1500       0  10.0
b  2019   上海  110000   1500       1  11.0
c  2020   广州  100000   1500       2   NaN
d  2021   深圳  150000   1500       3   NaN
e  2021   南京  150000   1500       3   NaN

In [151]:
df4x['v3'].loc['f'] = 'c'
# wrong

KeyError: 'v3'

In [ ]:
df4x.loc['c', 'people'] = 999

In [ ]:
df4x

## DELETE

In [ ]:
del df4x['p2']

In [152]:
df4x

   year city   price people people1    p2
a  2018   北京  120000   1500       0  10.0
b  2019   上海  110000   1500       1  11.0
c  2020   广州  100000   1500       2   NaN
d  2021   深圳  150000   1500       3   NaN
e  2021   南京  150000   1500       3   NaN

In [153]:
del df4x.people1

In [154]:
df4x

   year city   price people people1    p2
a  2018   北京  120000   1500       0  10.0
b  2019   上海  110000   1500       1  11.0
c  2020   广州  100000   1500       2   NaN
d  2021   深圳  150000   1500       3   NaN
e  2021   南京  150000   1500       3   NaN

In [155]:
del df4x.loc['e']

AttributeError: __delitem__

In [156]:
del df4x.loc['c', 'city']

AttributeError: __delitem__

## Transpose

In [157]:
dates = ['2021-07-01', '2021-07-02', '2021-07-03', '2021-07-04', '2021-07-05', '2021-07-06', '2021-07-07']

In [158]:
datesI = pd.to_datetime(dates)

In [159]:
datesI

DatetimeIndex(['2021-07-01', '2021-07-02', '2021-07-03', '2021-07-04',
               '2021-07-05', '2021-07-06', '2021-07-07'],
              dtype='datetime64[ns]', freq=None)

In [160]:
df5 = pd.DataFrame(np.random.randint(80, 100, (7,5)),
                   index = datesI,
                   columns = list('ABCDE')
                  )

In [161]:
df5

             A   B   C   D   E
2021-07-01  86  94  90  82  93
2021-07-02  90  84  87  80  82
2021-07-03  92  92  80  84  85
2021-07-04  88  92  88  82  96
2021-07-05  83  88  89  87  99
2021-07-06  89  98  96  97  81
2021-07-07  97  90  91  84  80

In [162]:
df5.T

,2021-07-01,2021-07-02,2021-07-03,2021-07-04,2021-07-05,2021-07-06,2021-07-07
A,86,90,92,88,83,89,97
B,94,84,92,92,88,98,90
C,90,87,80,88,89,96,91
D,82,80,84,82,87,97,84
E,93,82,85,96,99,81,80

In [163]:
df5

             A   B   C   D   E
2021-07-01  86  94  90  82  93
2021-07-02  90  84  87  80  82
2021-07-03  92  92  80  84  85
2021-07-04  88  92  88  82  96
2021-07-05  83  88  89  87  99
2021-07-06  89  98  96  97  81
2021-07-07  97  90  91  84  80

In [164]:
df6 = df5.T

In [165]:
df6

,2021-07-01,2021-07-02,2021-07-03,2021-07-04,2021-07-05,2021-07-06,2021-07-07
A,86,90,92,88,83,89,97
B,94,84,92,92,88,98,90
C,90,87,80,88,89,96,91
D,82,80,84,82,87,97,84
E,93,82,85,96,99,81,80

## Sort
### sort by value

In [166]:
df5.sort_values('A', axis=0, ascending=False)

             A   B   C   D   E
2021-07-07  97  90  91  84  80
2021-07-03  92  92  80  84  85
2021-07-02  90  84  87  80  82
2021-07-06  89  98  96  97  81
2021-07-04  88  92  88  82  96
2021-07-01  86  94  90  82  93
2021-07-05  83  88  89  87  99

In [167]:
df5.sort_values('2021-07-01', axis = 1)

             D   A   C   E   B
2021-07-01  82  86  90  93  94
2021-07-02  80  90  87  82  84
2021-07-03  84  92  80  85  92
2021-07-04  82  88  88  96  92
2021-07-05  87  83  89  99  88
2021-07-06  97  89  96  81  98
2021-07-07  84  97  91  80  90

In [168]:
df5.sort_index(ascending=False)

             A   B   C   D   E
2021-07-07  97  90  91  84  80
2021-07-06  89  98  96  97  81
2021-07-05  83  88  89  87  99
2021-07-04  88  92  88  82  96
2021-07-03  92  92  80  84  85
2021-07-02  90  84  87  80  82
2021-07-01  86  94  90  82  93

In [169]:
df5.sort_index(axis=1, ascending=False)

             E   D   C   B   A
2021-07-01  93  82  90  94  86
2021-07-02  82  80  87  84  90
2021-07-03  85  84  80  92  92
2021-07-04  96  82  88  92  88
2021-07-05  99  87  89  88  83
2021-07-06  81  97  96  98  89
2021-07-07  80  84  91  90  97